---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NoHostForSubregion
source: html/6ac26086-fe9c-8f4d-6bde-e7b8e2f4b567.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NoHostForSubregion Property

This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoHostForSubregion { get; }
```